public class 构造方法 {
    public static void main(String讲解[] args) {
        /*
         * 构造方法也叫做构造器、构造函数
         * 作用:
         * 在创建对象的时候给成员变量进行赋值
         * 构造方法的格式:
         * 修饰符 类名(参数) {
         * 方法体;
         * }
         * 构造方法的特点:
         * 1.方法名与类名相同, 大小写也要一致
         * 2.没有返回值类型, 连void都没有
         * 3.没有具体的返回值(不能由return带回结果数据)
         * 构造方法执行时机:
         * 1.创建对象的时候由虚拟机调用, 不能手动调用构造方法
         * 2.每创建一次对象, 就会调用一次构造方法
         * 构造方法的注意事项:
         * 1.如果没有定义构造方法, 系统将默认给出一个无参数构造方法
         * 2.如果定义了构造方法, 系统将不再提供默认的构造方法
         * 3.带参构造方法, 和无参数构造方法, 二者方法相同, 但是参数不同, 这叫做构造方法的重载
         * 4.无论是否使用, 都手动书写无参数构造方法, 和带全部参数的构造方法
         */
    }
}
